/**********************************************************************************************
 * @Method 설명 : 쿼리스트링 객체변환
 * @작성일   : 2018-12-10
 * @작성자   : 김은국
 * @변경이력  :
 **********************************************************************************************/
export function getURLParameters ( url = location.search ) {
    return (url.match(/([^?=&]+)(=([^&]*))/g) || []).reduce(
                (a, v) => ((a[v.slice(0, v.indexOf('='))] = v.slice(v.indexOf('=') + 1)), a),
                {}
            );
}

/**********************************************************************************************
 * @Method 설명 : 날짜포맷팅 yyyymmdd변경
 * @작성일   : 2019-01-02 
 * @작성자   : 김은국
 * @변경이력  :
 **********************************************************************************************/
export function yyyymmdd( date = new Date() ) {

    let mm = date.getMonth() + 1;
    let dd = date.getDate();

    return [date.getFullYear(),
        (mm > 9 ? '' : '0') + mm,
        (dd > 9 ? '' : '0') + dd
    ].join('');

}